TrelloTest/src/DataProcessors/TrelloThing/TrelloThing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>TrelloThing</name>
</mdclass:DataProcessor>

TrelloTest/src/InformationRegisters/ДоскиТрелло/ДоскиТрелло.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоскиТрелло</name>
  <dimensions>
    <name>ИмяДоски</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TrelloTest/src/DataProcessors/TrelloThing/Forms/Trello/Module.bsl
&НаКлиенте
Процедура ShowBoards(Команда)
	ShowBoardsНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура AddBoard(Команда)
	AddBoardНаСервере();
КонецПроцедуры

&НаСервере
Процедура AddBoardНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/boards?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить() + "&name=" + ИмяДоски;
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	Сообщить("Успешно добавлена доска " + ИмяДоски);
КонецПроцедуры


&НаСервере
Процедура ShowBoardsНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/members/me/boards?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить();
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	ТаблицаДосок = "Доска - id" + Символы.ПС + Символы.ПС;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоскиТрелло.ИмяДоски,
	|	ДоскиТрелло.ID
	|ИЗ
	|	РегистрСведений.ДоскиТрелло КАК ДоскиТрелло";
	Для Каждого Board Из ПакетСообщения Цикл
		ЗаписьЧек = Ложь;
		ТаблицаДосок = ТаблицаДосок + Board.name + " - " + Board.id + Символы.ПС;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИмяДоски = Board.name Тогда
				ЗаписьЧек = Ложь;
				Прервать;
			КонецЕсли;
			ЗаписьЧек = Истина;
		КонецЦикла;
		Если ЗаписьЧек Тогда
			Запись = РегистрыСведений.ДоскиТрелло.СоздатьМенеджерЗаписи();
			Запись.ИмяДоски = Board.name;
			Запись.ID = Board.id;
			Запись.Записать();
			Сообщить("Добавлена доска " + Board.name);
		КонецЕсли;
	КонецЦикла;
	Вывод = ТаблицаДосок;
КонецПроцедуры
